#include <iostream>
#include <iomanip>
#include <cmath>
#include <string>
using namespace std;

int main(){
	setlocale(LC_ALL, "Russian");
	
	string a[31] = {"первое","второе","третье","четвертое","пятое","шестое","седьмое","восьмое","девятое","десятое","одиннадцотое","двенадцатое","тринадцатое","четырнадцотое","пятнадцатое","шестнадцатое","семнадцатое","восемнадцатое","девятнадцатое","двадцатое","двадцать первое","двадцать второе","двадцать третье","двадцать четвертое","двадцать пятое","двадцать шестое","двадцать седьмое","двадцать восьмое","двадцать девятое", "тридцатое","тридцать первое"};
	string b[12] = {"января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря"};
	int d,m;
	cout << "введите день - ";
	cin >> d;
	cout << "введите месяц - ";
	cin >> m;
	cout << endl << "словами - " << a[d-1] << " " << b[m-1];
	return 0;
}

