#include <iostream>
#include <string>

using namespace std;

int main(){
	setlocale(LC_ALL, "Russian");
	
    string a0_9[10] = {"","один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    string a10_19[10] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    string a20_90[10] = {"двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    string a100_900[10] = {"сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    
    int x;
    cin >> x;
    int a=x/100,b=x%100/10,c=x%10;
    int d=x%100;
	cout << a100_900[a-1] << " ";
	
	if (d>10 && d<=19){
		cout << a10_19[d-10] << " ";
		return 0;
	}
	
    else if (b==1) cout << a10_19[0] << " ";
    else if (b>=2 && b<=9) cout << a20_90[b-2] << " ";
    
    cout << a0_9[c] << endl;
    return 0;
	}
